99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_stream.c
#include "esp32_mquickjs_stream.h"
#include "esp32_mquickjs_memory.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_fs.h"
#include "esp32_mquickjs_fs_events.h"
#include "esp32_mquickjs_future.h"

#include <errno.h>
#include <stdatomic.h>
#include <stdio.h>
#include <string.h>

#include "esp_heap_caps.h"
#include "utils/esp32_mquickjs_byte_source.h"

#define ESP32_MQUICKJS_MAX_STREAMS 16
#define ESP32_MQUICKJS_STREAM_READ_CHUNK_DEFAULT 1024
#define ESP32_MQUICKJS_STREAM_READ_ALL_CHUNK 1024

typedef enum {
    ESP32_MQUICKJS_STREAM_KIND_FILE = 0,
    ESP32_MQUICKJS_STREAM_KIND_MEMORY = 1,
    ESP32_MQUICKJS_STREAM_KIND_SOURCE = 2,
} esp32_mquickjs_stream_kind_t;

typedef struct {
    uint8_t stream_id;
    bool allocated;
    uint32_t generation;
    esp32_mquickjs_stream_kind_t kind;
    char mode[8];
    bool readable;
    bool writable;
    bool binary;
    bool seekable;
    bool externally_acquired;
    bool close_queued;
    bool release_pending;
    bool write_dirty;
    uint16_t owner_count;
    uint16_t future_reservations;
    char *path;
    union {
        FILE *file;
        struct {
            uint8_t *data;
            size_t len;
            size_t pos;
            bool owned;
        } memory;
        struct {
            JSContext *ctx;
            JSGCRef owner_ref;
            esp32_mquickjs_byte_span_source_t source;
            esp32_mquickjs_byte_span_t span;
            size_t span_offset;
            size_t total_read;
            size_t known_length;
            bool rooted;
            bool eof;
            bool has_known_length;
        } source;
    } handle;
} esp32_mquickjs_stream_slot_t;

typedef struct {
    int stream_id;
    uint32_t generation;
} esp32_mquickjs_stream_object_ref_t;

static bool s_streams_initialized;
static esp32_mquickjs_stream_slot_t s_streams[ESP32_MQUICKJS_MAX_STREAMS];

static void stream_init_once(void)
{
    int i;

    if (s_streams_initialized) {
        return;
    }
    memset(s_streams, 0, sizeof(s_streams));
    for (i = 0; i < ESP32_MQUICKJS_MAX_STREAMS; ++i) {
        s_streams[i].stream_id = (uint8_t)i;
    }
    s_streams_initialized = true;
}

static const char *stream_kind_name(esp32_mquickjs_stream_kind_t kind)
{
    return kind == ESP32_MQUICKJS_STREAM_KIND_MEMORY ? "memory" :
           kind == ESP32_MQUICKJS_STREAM_KIND_SOURCE ? "source" : "file";
}

static esp32_mquickjs_stream_slot_t *stream_alloc_slot(void)
{
    int i;

    stream_init_once();
    for (i = 0; i < ESP32_MQUICKJS_MAX_STREAMS; ++i) {
        if (!s_streams[i].allocated) {
            s_streams[i].allocated = true;
            s_streams[i].generation++;
            return &s_streams[i];
        }
    }
    return NULL;
}

static esp32_mquickjs_stream_slot_t *stream_get_slot(const esp32_mquickjs_fs_stream_ref_t *ref)
{
    esp32_mquickjs_stream_slot_t *slot;

    if (ref == NULL || ref->stream_id < 0 || ref->stream_id >= ESP32_MQUICKJS_MAX_STREAMS) {
        return NULL;
    }

    slot = &s_streams[ref->stream_id];
    if (!slot->allocated || slot->generation != ref->generation) {
        return NULL;
    }
    return slot;
}

static bool stream_slot_busy(const esp32_mquickjs_stream_slot_t *slot)
{
    return slot != NULL &&
           (slot->externally_acquired || slot->future_reservations > 0);
}

static void stream_cleanup_slot(esp32_mquickjs_stream_slot_t *slot)
{
    if (slot == NULL) {
        return;
    }

    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_FILE && slot->handle.file != NULL) {
        int close_result = fclose(slot->handle.file);

        slot->handle.file = NULL;
        if (close_result == 0 && slot->write_dirty && slot->path != NULL) {
            esp32_mquickjs_fs_notify_change(
                ESP32_MQUICKJS_FS_CHANGE_WRITE, slot->path, NULL);
        }
    } else if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_MEMORY && slot->handle.memory.owned) {
        esp32_mquickjs_memory_payload_free(slot->handle.memory.data);
        slot->handle.memory.data = NULL;
    } else if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_SOURCE) {
        esp32_mquickjs_byte_span_source_close(slot->handle.source.ctx,
                                              &slot->handle.source.source);
        if (slot->handle.source.rooted) {
            JS_DeleteGCRef(slot->handle.source.ctx,
                           &slot->handle.source.owner_ref);
            slot->handle.source.rooted = false;
        }
    }

    heap_caps_free(slot->path);
    slot->path = NULL;
    slot->allocated = false;
    slot->readable = false;
    slot->writable = false;
    slot->binary = false;
    slot->seekable = false;
    slot->externally_acquired = false;
    slot->close_queued = false;
    slot->release_pending = false;
    slot->write_dirty = false;
    slot->owner_count = 0;
    slot->future_reservations = 0;
    slot->kind = ESP32_MQUICKJS_STREAM_KIND_FILE;
    memset(slot->mode, 0, sizeof(slot->mode));
    memset(&slot->handle, 0, sizeof(slot->handle));
}

static bool stream_parse_mode(const char *mode, bool *out_readable, bool *out_writable)
{
    if (mode == NULL || out_readable == NULL || out_writable == NULL) {
        return false;
    }

    *out_readable = false;
    *out_writable = false;

    if (strcmp(mode, "r") == 0 || strcmp(mode, "rb") == 0) {
        *out_readable = true;
        return true;
    }
    if (strcmp(mode, "w") == 0 || strcmp(mode, "wb") == 0) {
        *out_writable = true;
        return true;
    }
    if (strcmp(mode, "a") == 0 || strcmp(mode, "ab") == 0) {
        *out_writable = true;
        return true;
    }
    if (strcmp(mode, "r+") == 0 || strcmp(mode, "rb+") == 0 || strcmp(mode, "r+b") == 0) {
        *out_readable = true;
        *out_writable = true;
        return true;
    }
    if (strcmp(mode, "w+") == 0 || strcmp(mode, "wb+") == 0 || strcmp(mode, "w+b") == 0) {
        *out_readable = true;
        *out_writable = true;
        return true;
    }
    if (strcmp(mode, "a+") == 0 || strcmp(mode, "ab+") == 0 || strcmp(mode, "a+b") == 0) {
        *out_readable = true;
        *out_writable = true;
        return true;
    }
    return false;
}

static int stream_ref_from_object(JSContext *ctx,
                                  JSValue value,
                                  const char *api_name,
                                  esp32_mquickjs_fs_stream_ref_t *out_ref)
{
    esp32_mquickjs_stream_object_ref_t *ref;

    if (out_ref == NULL) {
        return -1;
    }
    if (JS_GetClassID(ctx, value) != JS_CLASS_STREAM ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "%s expects a Stream object", api_name);
        return -1;
    }
    out_ref->stream_id = ref->stream_id;
    out_ref->generation = ref->generation;
    return 0;
}

static int stream_ref_try_from_object(JSContext *ctx,
                                      JSValue value,
                                      esp32_mquickjs_fs_stream_ref_t *out_ref)
{
    esp32_mquickjs_stream_object_ref_t *ref;

    if (out_ref == NULL || JS_GetClassID(ctx, value) != JS_CLASS_STREAM ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        return -1;
    }
    out_ref->stream_id = ref->stream_id;
    out_ref->generation = ref->generation;
    return 0;
}

static int stream_get_bound_ref(JSContext *ctx,
                                JSValue bound_value,
                                const char *api_name,
                                esp32_mquickjs_fs_stream_ref_t *out_ref,
                                esp32_mquickjs_stream_slot_t **out_slot)
{
    esp32_mquickjs_stream_slot_t *slot;

    if (stream_ref_from_object(ctx, bound_value, api_name, out_ref) != 0) {
        return -1;
    }
    slot = stream_get_slot(out_ref);
    if (slot == NULL) {
        JS_ThrowReferenceError(ctx, "%s failed because the stream is closed", api_name);
        return -1;
    }
    if (out_slot != NULL) {
        *out_slot = slot;
    }
    return 0;
}

