99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_stream.c
static int stream_get_this_slot(JSContext *ctx,
                                JSValue this_value,
                                const char *api_name,
                                esp32_mquickjs_fs_stream_ref_t *out_ref,
                                esp32_mquickjs_stream_slot_t **out_slot)
{
    return stream_get_bound_ref(ctx, this_value, api_name, out_ref, out_slot);
}

static JSValue stream_make_object(JSContext *ctx,
                                  JSValue global_obj,
                                  esp32_mquickjs_stream_slot_t *slot)
{
    JSGCRef stream_ref;
    JSValue *stream_obj;
    esp32_mquickjs_stream_object_ref_t *object_ref;

    (void)global_obj;
    stream_obj = JS_PushGCRef(ctx, &stream_ref);
    *stream_obj = JS_NewObjectClassUser(ctx, JS_CLASS_STREAM);
    if (JS_IsException(*stream_obj)) {
        goto fail;
    }
    object_ref = heap_caps_malloc(sizeof(*object_ref), MALLOC_CAP_8BIT);
    if (object_ref == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    object_ref->stream_id = slot->stream_id;
    object_ref->generation = slot->generation;
    JS_SetOpaque(ctx, *stream_obj, object_ref);

    if (!esp32_mquickjs_set_property_ref(ctx, stream_obj, "kind",
                                     JS_NewString(ctx, stream_kind_name(slot->kind))) ||
        !esp32_mquickjs_set_property_ref(ctx, stream_obj, "mode",
                                     JS_NewString(ctx, slot->mode[0] != '\0' ? slot->mode : "r")) ||
        !esp32_mquickjs_set_property_ref(ctx, stream_obj, "path",
                                     JS_NewString(ctx, slot->path != NULL ? slot->path : "")) ||
        !esp32_mquickjs_set_property_ref(ctx, stream_obj, "readable",
                                     JS_NewBool(slot->readable)) ||
        !esp32_mquickjs_set_property_ref(ctx, stream_obj, "writable",
                                     JS_NewBool(slot->writable)) ||
        !esp32_mquickjs_set_property_ref(ctx, stream_obj, "seekable",
                                     JS_NewBool(slot->seekable)) ||
        !esp32_mquickjs_set_property_ref(ctx, stream_obj, ESP32_MQUICKJS_FS_STREAM_ID_KEY,
                                     JS_NewInt32(ctx, slot->stream_id)) ||
        !esp32_mquickjs_set_property_ref(ctx, stream_obj, ESP32_MQUICKJS_FS_STREAM_GENERATION_KEY,
                                     JS_NewUint32(ctx, slot->generation))) {
        JS_SetOpaque(ctx, *stream_obj, NULL);
        heap_caps_free(object_ref);
        goto fail;
    }
    slot->owner_count++;
    return JS_PopGCRef(ctx, &stream_ref);

fail:
    JS_PopGCRef(ctx, &stream_ref);
    return JS_EXCEPTION;
}

static int stream_open_memory_owned_slot(uint8_t *data,
                                         size_t data_len,
                                         bool binary,
                                         esp32_mquickjs_stream_slot_t **out_slot)
{
    esp32_mquickjs_stream_slot_t *slot = stream_alloc_slot();

    if (slot == NULL) {
        return -1;
    }

    slot->kind = ESP32_MQUICKJS_STREAM_KIND_MEMORY;
    slot->readable = true;
    slot->writable = false;
    slot->binary = binary;
    slot->seekable = true;
    memcpy(slot->mode, binary ? "rb" : "r", binary ? 3 : 2);
    slot->handle.memory.data = data;
    slot->handle.memory.len = data_len;
    slot->handle.memory.pos = 0;
    slot->handle.memory.owned = true;
    if (out_slot != NULL) {
        *out_slot = slot;
    }
    return 0;
}

static int stream_slot_read(esp32_mquickjs_stream_slot_t *slot,
                            void *buf,
                            size_t buf_len,
                            size_t *out_len)
{
    if (out_len != NULL) {
        *out_len = 0;
    }
    if (slot == NULL || buf == NULL || buf_len == 0 || out_len == NULL || !slot->readable) {
        return -1;
    }

    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_FILE) {
        size_t read_len = fread(buf, 1, buf_len, slot->handle.file);

        if (read_len == 0 && ferror(slot->handle.file) != 0) {
            return -1;
        }
        *out_len = read_len;
        return 0;
    }

    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_MEMORY) {
        size_t available = slot->handle.memory.len > slot->handle.memory.pos
                               ? slot->handle.memory.len - slot->handle.memory.pos
                               : 0;
        size_t read_len = available < buf_len ? available : buf_len;

        if (read_len > 0) {
            memcpy(buf, slot->handle.memory.data + slot->handle.memory.pos, read_len);
            slot->handle.memory.pos += read_len;
        }
        *out_len = read_len;
        return 0;
    }

    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_SOURCE) {
        size_t copied = 0;
        unsigned empty_spans = 0;

        while (copied < buf_len && !slot->handle.source.eof) {
            size_t available;
            size_t take;

            if (slot->handle.source.span_offset >= slot->handle.source.span.length) {
                esp32_mquickjs_byte_span_clear(&slot->handle.source.span);
                slot->handle.source.span_offset = 0;
                if (!esp32_mquickjs_byte_span_source_next(
                        slot->handle.source.ctx,
                        &slot->handle.source.source,
                        &slot->handle.source.span)) {
                    if (JS_HasException(slot->handle.source.ctx)) {
                        return -1;
                    }
                    slot->handle.source.eof = true;
                    break;
                }
                if (slot->handle.source.span.length == 0) {
                    if (++empty_spans > 16) {
                        return -1;
                    }
                    continue;
                }
                if (slot->handle.source.span.data == NULL) {
                    return -1;
                }
            }
            available = slot->handle.source.span.length -
                        slot->handle.source.span_offset;
            take = available < (buf_len - copied) ? available :
                   (buf_len - copied);
            memcpy((uint8_t *)buf + copied,
                   slot->handle.source.span.data +
                       slot->handle.source.span_offset,
                   take);
            slot->handle.source.span_offset += take;
            slot->handle.source.total_read += take;
            copied += take;
        }
        *out_len = copied;
        return 0;
    }

    return -1;
}

static int stream_slot_seek(esp32_mquickjs_stream_slot_t *slot,
                            int offset,
                            int whence,
                            int64_t *out_pos)
{
    if (slot == NULL || !slot->seekable || out_pos == NULL) {
        return -1;
    }

    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_FILE) {
        long pos;

        if (fseek(slot->handle.file, (long)offset, whence) != 0) {
            return -1;
        }
        pos = ftell(slot->handle.file);
        if (pos < 0) {
            return -1;
        }
        *out_pos = (int64_t)pos;
        return 0;
    }

    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_MEMORY) {
        int64_t base = 0;
        int64_t pos = 0;

