99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_stream.c
        if (whence == SEEK_CUR) {
            base = (int64_t)slot->handle.memory.pos;
        } else if (whence == SEEK_END) {
            base = (int64_t)slot->handle.memory.len;
        } else if (whence != SEEK_SET) {
            return -1;
        }

        pos = base + (int64_t)offset;
        if (pos < 0 || (size_t)pos > slot->handle.memory.len) {
            return -1;
        }
        slot->handle.memory.pos = (size_t)pos;
        *out_pos = pos;
        return 0;
    }

    return -1;
}

static int64_t stream_slot_tell(esp32_mquickjs_stream_slot_t *slot)
{
    if (slot == NULL) {
        return -1;
    }
    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_FILE) {
        long pos = ftell(slot->handle.file);
        return pos < 0 ? -1 : (int64_t)pos;
    }
    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_MEMORY) {
        return (int64_t)slot->handle.memory.pos;
    }
    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_SOURCE) {
        return (int64_t)slot->handle.source.total_read;
    }
    return -1;
}

static bool stream_slot_eof(esp32_mquickjs_stream_slot_t *slot)
{
    if (slot == NULL) {
        return true;
    }
    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_FILE) {
        return feof(slot->handle.file) != 0;
    }
    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_MEMORY) {
        return slot->handle.memory.pos >= slot->handle.memory.len;
    }
    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_SOURCE) {
        return slot->handle.source.eof;
    }
    return true;
}

JSValue esp32_mquickjs_stream_adopt_file(JSContext *ctx,
                                         JSValue global_obj,
                                         const char *path,
                                         const char *mode,
                                         void *file_handle,
                                         bool initial_write_dirty)
{
    esp32_mquickjs_stream_slot_t *slot;
    JSValue result;

    if (path == NULL || mode == NULL || file_handle == NULL ||
        strlen(mode) >= sizeof(s_streams[0].mode)) {
        if (file_handle != NULL) {
            fclose((FILE *)file_handle);
        }
        return JS_ThrowTypeError(ctx, "invalid file stream");
    }
    slot = stream_alloc_slot();
    if (slot == NULL) {
        fclose((FILE *)file_handle);
        return JS_ThrowInternalError(ctx, "too many open streams");
    }
    if (!stream_parse_mode(mode, &slot->readable, &slot->writable)) {
        slot->allocated = false;
        fclose((FILE *)file_handle);
        return JS_ThrowTypeError(ctx, "unsupported stream mode: %s", mode);
    }
    slot->kind = ESP32_MQUICKJS_STREAM_KIND_FILE;
    slot->binary = strchr(mode, 'b') != NULL;
    slot->seekable = true;
    slot->write_dirty = initial_write_dirty;
    slot->handle.file = (FILE *)file_handle;
    slot->path = heap_caps_malloc(strlen(path) + 1, MALLOC_CAP_8BIT);
    if (slot->path == NULL) {
        stream_cleanup_slot(slot);
        return JS_ThrowOutOfMemory(ctx);
    }
    memcpy(slot->path, path, strlen(path) + 1);
    memcpy(slot->mode, mode, strlen(mode) + 1);

    result = stream_make_object(ctx, global_obj, slot);
    if (JS_IsException(result)) {
        stream_cleanup_slot(slot);
    }
    return result;
}

JSValue esp32_mquickjs_stream_open_memory_owned(JSContext *ctx,
                                                JSValue global_obj,
                                                char *data,
                                                size_t data_len)
{
    esp32_mquickjs_stream_slot_t *slot;
    JSValue result;

    if (data == NULL && data_len != 0) {
        return JS_ThrowInternalError(ctx, "memory stream requires valid data");
    }
    if (stream_open_memory_owned_slot((uint8_t *)data, data_len, false, &slot) != 0) {
        esp32_mquickjs_memory_payload_free(data);
        return JS_ThrowInternalError(ctx, "too many open streams");
    }

    result = stream_make_object(ctx, global_obj, slot);
    if (JS_IsException(result)) {
        stream_cleanup_slot(slot);
    }
    return result;
}

JSValue esp32_mquickjs_stream_open_memory_owned_binary(JSContext *ctx,
                                                       JSValue global_obj,
                                                       uint8_t *data,
                                                       size_t data_len)
{
    esp32_mquickjs_stream_slot_t *slot;
    JSValue result;

    if (data == NULL && data_len != 0) {
        return JS_ThrowInternalError(ctx, "binary memory stream requires valid data");
    }
    if (stream_open_memory_owned_slot(data, data_len, true, &slot) != 0) {
        esp32_mquickjs_memory_payload_free(data);
        return JS_ThrowInternalError(ctx, "too many open streams");
    }
    result = stream_make_object(ctx, global_obj, slot);
    if (JS_IsException(result)) {
        stream_cleanup_slot(slot);
    }
    return result;
}

JSValue esp32_mquickjs_stream_open_bytes_copy(JSContext *ctx,
                                              JSValue global_obj,
                                              JSValue bytes_value,
                                              const char *api_name)
{
    esp32_mquickjs_byte_source_t source;
    uint8_t *converted = NULL;
    uint8_t *copy = NULL;
    JSValue error = JS_UNDEFINED;

    if (!esp32_mquickjs_get_byte_source(ctx, bytes_value, api_name,
                                        &source, &converted, &error)) {
        return JS_IsUndefined(error) ? JS_EXCEPTION : error;
    }
    if (source.length > 0) {
        copy = esp32_mquickjs_memory_payload_alloc(
            "stream.copy", source.length,
            ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (copy == NULL) {
            esp32_mquickjs_release_byte_source(converted);
            return JS_ThrowOutOfMemory(ctx);
        }
        memcpy(copy, source.data, source.length);
    }
    esp32_mquickjs_release_byte_source(converted);
    return esp32_mquickjs_stream_open_memory_owned_binary(ctx, global_obj,
                                                          copy, source.length);
}

JSValue esp32_mquickjs_stream_open_byte_source(JSContext *ctx,
                                               JSValue global_obj,
                                               JSValue source_value)
{
    esp32_mquickjs_stream_slot_t *slot = stream_alloc_slot();
    JSValue error = JS_UNDEFINED;
    JSValue *owner;
    JSValue result;

    if (slot == NULL) {
        return JS_ThrowInternalError(ctx, "too many open streams");
    }
    slot->kind = ESP32_MQUICKJS_STREAM_KIND_SOURCE;
    slot->readable = true;
    slot->binary = true;
    slot->seekable = false;
    memcpy(slot->mode, "rb", 3);
    slot->handle.source.ctx = ctx;
    esp32_mquickjs_byte_span_clear(&slot->handle.source.span);
    if (!esp32_mquickjs_open_byte_span_source(ctx, source_value,
                                              "binary body",
                                              &slot->handle.source.source,
                                              &error)) {
        slot->allocated = false;
        return JS_IsUndefined(error) ? JS_EXCEPTION : error;
    }
    owner = JS_AddGCRef(ctx, &slot->handle.source.owner_ref);
    *owner = source_value;
    slot->handle.source.rooted = true;
    slot->handle.source.has_known_length =
        esp32_mquickjs_byte_span_source_known_length(
            ctx, source_value, &slot->handle.source.known_length);
    result = stream_make_object(ctx, global_obj, slot);
    if (JS_IsException(result)) {
        stream_cleanup_slot(slot);
    }
    return result;
}

JSValue esp32_mquickjs_stream_clone(JSContext *ctx, JSValue global_obj, JSValue stream_value)
{
    esp32_mquickjs_fs_stream_ref_t ref;
    esp32_mquickjs_stream_slot_t *slot;

    if (stream_ref_from_object(ctx, stream_value, "Stream", &ref) != 0) {
        return JS_EXCEPTION;
    }
    slot = stream_get_slot(&ref);
    if (slot == NULL) {
        return JS_ThrowReferenceError(ctx, "stream is closed");
    }
    return stream_make_object(ctx, global_obj, slot);
}

bool esp32_mquickjs_fs_parse_stream_ref(JSContext *ctx,
                                        JSValue stream_value,
                                        esp32_mquickjs_fs_stream_ref_t *out_ref)
{
    if (stream_ref_from_object(ctx, stream_value, "Stream", out_ref) != 0) {
        return false;
    }
    if (stream_get_slot(out_ref) == NULL) {
        JS_ThrowReferenceError(ctx, "Stream expects an open stream");
        return false;
    }
    return true;
}

bool esp32_mquickjs_stream_is_stream(JSContext *ctx, JSValue stream_value)
{
    esp32_mquickjs_fs_stream_ref_t ref;

