99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_stream.c
    return stream_ref_from_object(ctx, stream_value, "Stream", &ref) == 0 && stream_get_slot(&ref) != NULL;
}

int esp32_mquickjs_stream_read_all_text(JSContext *ctx,
                                        JSValue stream_value,
                                        const char *api_name,
                                        char **out_text,
                                        size_t *out_len)
{
    esp32_mquickjs_fs_stream_ref_t ref;
    esp32_mquickjs_stream_slot_t *slot;
    char *buffer = NULL;
    size_t length = 0;
    size_t capacity = 0;
    int result = -1;

    if (out_text == NULL || out_len == NULL) {
        return -1;
    }
    *out_text = NULL;
    *out_len = 0;

    if (stream_ref_from_object(ctx, stream_value, api_name, &ref) != 0) {
        return -1;
    }
    slot = stream_get_slot(&ref);
    if (slot == NULL || !slot->readable || stream_slot_busy(slot)) {
        JS_ThrowTypeError(ctx, "%s expects a readable Stream", api_name);
        return -1;
    }

    for (;;) {
        uint8_t chunk[ESP32_MQUICKJS_STREAM_READ_ALL_CHUNK];
        size_t read_len = 0;

        if (stream_slot_read(slot, chunk, sizeof(chunk), &read_len) != 0) {
            JS_ThrowInternalError(ctx, "%s failed while reading the stream", api_name);
            goto done;
        }
        if (read_len == 0) {
            break;
        }
        if (read_len > SIZE_MAX - length - 1U) {
            JS_ThrowOutOfMemory(ctx);
            goto done;
        }
        if (capacity < length + read_len + 1) {
            size_t new_capacity = capacity == 0 ? 1024 : capacity;
            char *grown;

            while (new_capacity < length + read_len + 1) {
                if (new_capacity > SIZE_MAX / 2U) {
                    new_capacity = length + read_len + 1U;
                    break;
                }
                new_capacity *= 2U;
            }
            grown = esp32_mquickjs_memory_payload_realloc(
                "stream.read", buffer, new_capacity,
                ESP32_MQUICKJS_MEMORY_EXTERNAL);
            if (grown == NULL) {
                JS_ThrowOutOfMemory(ctx);
                goto done;
            }
            buffer = grown;
            capacity = new_capacity;
        }
        memcpy(buffer + length, chunk, read_len);
        length += read_len;
    }

    if (buffer == NULL) {
        buffer = esp32_mquickjs_memory_payload_alloc(
            "stream.read", 1, ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (buffer == NULL) {
            JS_ThrowOutOfMemory(ctx);
            goto done;
        }
    }
    buffer[length] = '\0';
    *out_text = buffer;
    *out_len = length;
    buffer = NULL;
    result = 0;

done:
    esp32_mquickjs_memory_payload_free(buffer);
    return result;
}

int esp32_mquickjs_stream_read_all_bytes(JSContext *ctx,
                                         JSValue stream_value,
                                         const char *api_name,
                                         size_t max_bytes,
                                         uint8_t **out_data,
                                         size_t *out_len)
{
    esp32_mquickjs_fs_stream_ref_t ref;
    esp32_mquickjs_stream_slot_t *slot;
    uint8_t *buffer = NULL;
    size_t length = 0;
    size_t capacity = 0;

    if (out_data == NULL || out_len == NULL || max_bytes == 0) {
        return -1;
    }
    *out_data = NULL;
    *out_len = 0;
    if (stream_ref_from_object(ctx, stream_value, api_name, &ref) != 0) {
        return -1;
    }
    slot = stream_get_slot(&ref);
    if (slot == NULL || !slot->readable || stream_slot_busy(slot)) {
        JS_ThrowTypeError(ctx, "%s expects a readable Stream", api_name);
        return -1;
    }

    for (;;) {
        uint8_t chunk[ESP32_MQUICKJS_STREAM_READ_ALL_CHUNK];
        size_t read_len = 0;
        size_t needed;

        if (stream_slot_read(slot, chunk, sizeof(chunk), &read_len) != 0) {
            JS_ThrowInternalError(ctx, "%s failed while reading the stream", api_name);
            goto fail;
        }
        if (read_len == 0) {
            break;
        }
        if (read_len > max_bytes || length > max_bytes - read_len) {
            JS_ThrowRangeError(ctx, "%s body exceeds maxBytes", api_name);
            goto fail;
        }
        needed = length + read_len;
        if (capacity < needed) {
            size_t new_capacity = capacity == 0 ? 1024 : capacity;
            uint8_t *grown;

            while (new_capacity < needed && new_capacity < max_bytes) {
                size_t doubled = new_capacity > SIZE_MAX / 2
                                     ? max_bytes
                                     : new_capacity * 2;
                new_capacity = doubled > max_bytes ? max_bytes : doubled;
            }
            grown = esp32_mquickjs_memory_payload_realloc(
                "stream.read", buffer, new_capacity,
                ESP32_MQUICKJS_MEMORY_EXTERNAL);
            if (grown == NULL) {
                JS_ThrowOutOfMemory(ctx);
                goto fail;
            }
            buffer = grown;
            capacity = new_capacity;
        }
        memcpy(buffer + length, chunk, read_len);
        length += read_len;
    }

    *out_data = buffer;
    *out_len = length;
    return 0;

fail:
    esp32_mquickjs_memory_payload_free(buffer);
    return -1;
}

bool esp32_mquickjs_stream_is_binary(
    const esp32_mquickjs_fs_stream_ref_t *ref)
{
    esp32_mquickjs_stream_slot_t *slot = stream_get_slot(ref);

    return slot != NULL && slot->binary;
}

bool esp32_mquickjs_stream_known_length(
    const esp32_mquickjs_fs_stream_ref_t *ref,
    size_t *out_length)
{
    esp32_mquickjs_stream_slot_t *slot = stream_get_slot(ref);

    if (slot == NULL || out_length == NULL) {
        return false;
    }
    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_MEMORY) {
        *out_length = slot->handle.memory.len - slot->handle.memory.pos;
        return true;
    }
    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_SOURCE &&
        slot->handle.source.has_known_length &&
        slot->handle.source.total_read <= slot->handle.source.known_length) {
        *out_length = slot->handle.source.known_length -
                      slot->handle.source.total_read;
        return true;
    }
    return false;
}

