99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_stream.c
void esp32_mquickjs_deinit_stream_runtime(void)
{
    size_t i;

    stream_init_once();
    for (i = 0; i < ESP32_MQUICKJS_MAX_STREAMS; ++i) {
        if (s_streams[i].allocated) {
            stream_cleanup_slot(&s_streams[i]);
        }
    }
}

esp_err_t esp32_mquickjs_stream_close_value(JSContext *ctx, JSValue stream_value)
{
    esp32_mquickjs_fs_stream_ref_t ref;
    esp32_mquickjs_stream_slot_t *slot;

    if (stream_ref_try_from_object(ctx, stream_value, &ref) != 0) {
        return ESP_ERR_INVALID_ARG;
    }
    slot = stream_get_slot(&ref);
    if (slot == NULL || stream_slot_busy(slot)) {
        return ESP_ERR_INVALID_STATE;
    }
    return esp32_mquickjs_fs_stream_close(&ref);
}

esp_err_t esp32_mquickjs_fs_stream_read(const esp32_mquickjs_fs_stream_ref_t *ref,
                                        void *buf,
                                        size_t buf_len,
                                        size_t *out_len)
{
    esp32_mquickjs_stream_slot_t *slot;

    if (out_len != NULL) {
        *out_len = 0;
    }
    if (buf == NULL || buf_len == 0 || out_len == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    slot = stream_get_slot(ref);
    if (slot == NULL || !slot->externally_acquired) {
        return ESP_ERR_INVALID_STATE;
    }
    if (stream_slot_read(slot, buf, buf_len, out_len) != 0) {
        return ESP_ERR_INVALID_STATE;
    }
    return ESP_OK;
}

esp_err_t esp32_mquickjs_fs_stream_acquire(
    const esp32_mquickjs_fs_stream_ref_t *ref)
{
    esp32_mquickjs_stream_slot_t *slot = stream_get_slot(ref);

    if (slot == NULL || stream_slot_busy(slot)) {
        return ESP_ERR_INVALID_STATE;
    }
    slot->externally_acquired = true;
    return ESP_OK;
}

esp_err_t esp32_mquickjs_fs_stream_close(const esp32_mquickjs_fs_stream_ref_t *ref)
{
    esp32_mquickjs_stream_slot_t *slot;

    slot = stream_get_slot(ref);
    if (slot == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    stream_cleanup_slot(slot);
    return ESP_OK;
}

typedef enum {
    STREAM_FUTURE_READ,
    STREAM_FUTURE_WRITE,
    STREAM_FUTURE_FLUSH,
    STREAM_FUTURE_CLOSE,
    STREAM_FUTURE_SEEK,
} stream_future_kind_t;

struct esp32_mquickjs_future_driver_state {
    stream_future_kind_t kind;
    JSContext *ctx;
    esp32_mquickjs_fs_stream_ref_t ref;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    uint8_t *data;
    size_t data_length;
    size_t io_length;
    int offset;
    int whence;
    int64_t position;
    int error_number;
    bool binary;
    bool closed;
    bool reservation_retained;
    esp32_mquickjs_byte_span_source_t span_source;
    esp32_mquickjs_byte_span_t span;
    JSGCRef source_error_ref;
    bool span_source_opened;
    bool source_error_retained;
    bool span_worker_active;
    esp32_mquickjs_resource_key_t resource_key;
    _Atomic bool span_worker_completed;
    _Atomic bool completed;
    _Atomic bool cancelled;
};

static void stream_future_release(
    esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_stream_slot_t *slot;

    if (state == NULL) {
        return;
    }
    esp32_mquickjs_memory_payload_free(state->data);
    if (state->span_source_opened) {
        esp32_mquickjs_byte_span_source_close(state->ctx,
                                               &state->span_source);
        state->span_source_opened = false;
    }
    if (state->source_error_retained) {
        JS_DeleteGCRef(state->ctx, &state->source_error_ref);
        state->source_error_retained = false;
    }
    slot = stream_get_slot(&state->ref);
    if (slot != NULL) {
        if (state->reservation_retained && slot->future_reservations > 0) {
            slot->future_reservations--;
            state->reservation_retained = false;
        }
        if (state->kind == STREAM_FUTURE_CLOSE && !state->closed) {
            slot->close_queued = false;
        }
        if (slot->future_reservations == 0 && !slot->externally_acquired &&
            (state->closed || slot->release_pending)) {
            stream_cleanup_slot(slot);
        }
    }
    heap_caps_free(state);
}

static bool stream_future_prepare_common(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    stream_future_kind_t kind,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    esp32_mquickjs_stream_slot_t *slot;

    if (out_state == NULL) {
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    if (stream_ref_from_object(ctx, this_ref->val, "Stream operation",
                               &state->ref) != 0 ||
        (slot = stream_get_slot(&state->ref)) == NULL) {
        heap_caps_free(state);
        return false;
    }
    if (slot->externally_acquired || slot->close_queued ||
        slot->future_reservations == UINT16_MAX) {
        heap_caps_free(state);
        JS_ThrowInternalError(ctx,
                              "Stream operation refused because the stream is busy");
        return false;
    }
    atomic_init(&state->completed, false);
    atomic_init(&state->cancelled, false);
    atomic_init(&state->span_worker_completed, false);
    state->kind = kind;
    state->ctx = ctx;
    state->binary = slot->binary;
    esp32_mquickjs_byte_span_clear(&state->span);
    state->resource_key = slot->kind == ESP32_MQUICKJS_STREAM_KIND_FILE
        ? esp32_mquickjs_fs_resource_key_for_path(slot->path)
        : slot;
    if (state->resource_key == NULL) {
        JS_ThrowInternalError(ctx,
                              "Stream operation could not resolve its resource lane");
        goto fail;
    }
    slot->future_reservations++;
    state->reservation_retained = true;
    if (kind == STREAM_FUTURE_CLOSE) {
        slot->close_queued = true;
    }

    if (kind == STREAM_FUTURE_READ) {
        int chunk_size = ESP32_MQUICKJS_STREAM_READ_CHUNK_DEFAULT;

        if (!slot->readable || argc > 1 ||
            (argc == 1 && !JS_IsUndefined(argv[0].val) &&
             !JS_IsNull(argv[0].val) &&
             JS_ToInt32(ctx, &chunk_size, argv[0].val) != 0) ||
            chunk_size <= 0) {
            JS_ThrowTypeError(ctx,
                              "stream.read(size?) requires a readable stream and a positive size");
            goto fail;
        }
        state->data_length = (size_t)chunk_size;
        state->data = esp32_mquickjs_memory_payload_alloc(
            "stream.read",
            state->data_length + (state->binary ? 0U : 1U),
            ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (state->data == NULL) {
            JS_ThrowOutOfMemory(ctx);
            goto fail;
        }
    } else if (kind == STREAM_FUTURE_WRITE) {
        if (!slot->writable || slot->kind != ESP32_MQUICKJS_STREAM_KIND_FILE ||
            argc != 1) {
            JS_ThrowTypeError(ctx,
                              "stream.write(data) requires a writable file stream");
            goto fail;
        }
        if (slot->binary) {
            int class_id = JS_GetClassID(ctx, argv[0].val);

            if (class_id == JS_CLASS_BYTE_SPAN_SOURCE ||
                class_id == JS_CLASS_BITMAP_SPAN_SOURCE) {
                JSValue error = JS_UNDEFINED;

                if (!esp32_mquickjs_open_byte_span_source(
                        ctx, argv[0].val, "stream.write(data)",
                        &state->span_source, &error)) {
                    if (!JS_HasException(ctx)) {
                        JS_ThrowInternalError(
                            ctx,
                            "stream.write(data) could not open its source");
                    }
                    goto fail;
                }
                state->span_source_opened = true;
            } else {
                esp32_mquickjs_byte_source_t source;
                uint8_t *owned = NULL;
                JSValue error = JS_UNDEFINED;

                if (!esp32_mquickjs_get_byte_source(
                        ctx, argv[0].val, "stream.write(data)",
                        &source, &owned, &error)) {
                    goto fail;
                }
                state->data_length = source.length;
                if (source.length > 0) {
                    state->data = esp32_mquickjs_memory_payload_alloc(
                        "stream.write", source.length,
                        ESP32_MQUICKJS_MEMORY_EXTERNAL);
                    if (state->data != NULL) {
                        memcpy(state->data, source.data, source.length);
                    }
                }
                esp32_mquickjs_release_byte_source(owned);
                if (source.length > 0 && state->data == NULL) {
                    JS_ThrowOutOfMemory(ctx);
                    goto fail;
                }
            }
        } else {
            JSCStringBuf text_buf;
            const char *text;

            if (!JS_IsString(ctx, argv[0].val)) {
                JS_ThrowTypeError(
                    ctx, "stream.write(text) expects a string in text mode");
                goto fail;
            }
            text = JS_ToCStringLen(ctx, &state->data_length,
                                   argv[0].val, &text_buf);
            if (text == NULL) {
                goto fail;
            }
            if (state->data_length > 0) {
                state->data = esp32_mquickjs_memory_payload_alloc(
                    "stream.write", state->data_length,
                    ESP32_MQUICKJS_MEMORY_EXTERNAL);
                if (state->data == NULL) {
                    JS_ThrowOutOfMemory(ctx);
                    goto fail;
                }
                memcpy(state->data, text, state->data_length);
            }
        }
    } else if (kind == STREAM_FUTURE_FLUSH) {
        if (!slot->writable || argc != 0) {
            JS_ThrowTypeError(ctx,
                              "stream.flush() requires a writable stream");
            goto fail;
        }
    } else if (kind == STREAM_FUTURE_CLOSE) {
        if (argc != 0) {
            JS_ThrowTypeError(ctx, "stream.close() expects no arguments");
            goto fail;
        }
    } else {
        state->whence = SEEK_SET;
        if (!slot->seekable || argc < 1 || argc > 2 ||
            JS_ToInt32(ctx, &state->offset, argv[0].val) != 0 ||
            (argc == 2 && !JS_IsUndefined(argv[1].val) &&
             !JS_IsNull(argv[1].val) &&
             JS_ToInt32(ctx, &state->whence, argv[1].val) != 0)) {
            JS_ThrowTypeError(
                ctx, "stream.seek(offset, whence?) requires a seekable stream");
            goto fail;
        }
    }
    *out_state = state;
    return true;

