99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_stream.c
fail:
    stream_future_release(state);
    return false;
}

#define STREAM_PREPARE(name, kind_value) \
    static bool name(JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv, \
                     esp32_mquickjs_future_driver_state_t **out_state) \
    { \
        return stream_future_prepare_common(ctx, this_ref, argc, argv, \
                                            kind_value, out_state); \
    }

STREAM_PREPARE(stream_read_future_prepare, STREAM_FUTURE_READ)
STREAM_PREPARE(stream_write_future_prepare, STREAM_FUTURE_WRITE)
STREAM_PREPARE(stream_flush_future_prepare, STREAM_FUTURE_FLUSH)
STREAM_PREPARE(stream_close_future_prepare, STREAM_FUTURE_CLOSE)
STREAM_PREPARE(stream_seek_future_prepare, STREAM_FUTURE_SEEK)

#undef STREAM_PREPARE

static void stream_future_retain_source_exception(
    esp32_mquickjs_future_driver_state_t *state,
    const char *fallback)
{
    JSValue *error;

    if (state == NULL || state->source_error_retained) {
        return;
    }
    if (!JS_HasException(state->ctx)) {
        (void)JS_ThrowInternalError(state->ctx, "%s", fallback);
    }
    error = JS_AddGCRef(state->ctx, &state->source_error_ref);
    *error = JS_GetException(state->ctx);
    state->source_error_retained = true;
}

static bool stream_future_next_source_span(
    esp32_mquickjs_future_driver_state_t *state)
{
    unsigned empty_spans = 0;

    while (state != NULL && state->span_source_opened &&
           !atomic_load_explicit(&state->cancelled, memory_order_acquire)) {
        if (!esp32_mquickjs_byte_span_source_next(
                state->ctx, &state->span_source, &state->span)) {
            if (JS_HasException(state->ctx)) {
                stream_future_retain_source_exception(
                    state, "stream.write(data) source iteration failed");
            }
            atomic_store_explicit(&state->completed, true,
                                  memory_order_release);
            return false;
        }
        if (state->span.length == 0) {
            if (++empty_spans > 16U) {
                (void)JS_ThrowInternalError(
                    state->ctx,
                    "stream.write(data) source produced too many empty spans");
                stream_future_retain_source_exception(
                    state, "stream.write(data) source iteration failed");
                atomic_store_explicit(&state->completed, true,
                                      memory_order_release);
                return false;
            }
            continue;
        }
        if (state->span.data == NULL ||
            state->span.length > SIZE_MAX - state->io_length) {
            (void)JS_ThrowInternalError(
                state->ctx,
                "stream.write(data) source produced an invalid span");
            stream_future_retain_source_exception(
                state, "stream.write(data) source produced an invalid span");
            atomic_store_explicit(&state->completed, true,
                                  memory_order_release);
            return false;
        }
        return true;
    }
    atomic_store_explicit(&state->completed, true, memory_order_release);
    return false;
}

static void stream_future_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;
    esp32_mquickjs_stream_slot_t *slot = state == NULL
        ? NULL : stream_get_slot(&state->ref);

    errno = 0;
    if (slot == NULL) {
        if (state != NULL) {
            state->error_number = EBADF;
        }
    } else if (state->kind == STREAM_FUTURE_READ) {
        if (stream_slot_read(slot, state->data, state->data_length,
                             &state->io_length) != 0) {
            state->error_number = errno != 0 ? errno : EIO;
        }
    } else if (state->kind == STREAM_FUTURE_WRITE) {
        if (state->span_source_opened) {
            if (!atomic_load_explicit(&state->cancelled,
                                      memory_order_acquire)) {
                size_t written = fwrite(state->span.data, 1,
                                        state->span.length,
                                        slot->handle.file);

                if (written != state->span.length) {
                    state->error_number = errno != 0 ? errno : EIO;
                } else {
                    state->io_length += written;
                    if (written > 0) {
                        slot->write_dirty = true;
                    }
                }
            }
            atomic_store_explicit(&state->span_worker_completed, true,
                                  memory_order_release);
            return;
        }
        state->io_length = fwrite(state->data, 1, state->data_length,
                                  slot->handle.file);
        if (state->io_length != state->data_length) {
            state->error_number = errno != 0 ? errno : EIO;
        } else if (state->io_length > 0) {
            slot->write_dirty = true;
        }
    } else if (state->kind == STREAM_FUTURE_FLUSH) {
        if (fflush(slot->handle.file) != 0) {
            state->error_number = errno != 0 ? errno : EIO;
        } else if (slot->write_dirty) {
            esp32_mquickjs_fs_notify_change(
                ESP32_MQUICKJS_FS_CHANGE_WRITE, slot->path, NULL);
            slot->write_dirty = false;
        }
    } else if (state->kind == STREAM_FUTURE_CLOSE) {
        if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_FILE &&
            slot->handle.file != NULL) {
            if (fclose(slot->handle.file) != 0) {
                state->error_number = errno != 0 ? errno : EIO;
            } else if (slot->write_dirty) {
                esp32_mquickjs_fs_notify_change(
                    ESP32_MQUICKJS_FS_CHANGE_WRITE, slot->path, NULL);
                slot->write_dirty = false;
            }
            slot->handle.file = NULL;
        }
        state->closed = true;
    } else if (stream_slot_seek(slot, state->offset, state->whence,
                                &state->position) != 0) {
        state->error_number = errno != 0 ? errno : EIO;
    }
    if (state != NULL) {
        atomic_store_explicit(&state->completed, true, memory_order_release);
    }
}

