99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_stream.c
static bool stream_future_start(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_stream_slot_t *slot = state == NULL
        ? NULL : stream_get_slot(&state->ref);

    if (slot == NULL) {
        return false;
    }
    state->runtime = runtime;
    state->token = token;
    if (slot->kind == ESP32_MQUICKJS_STREAM_KIND_FILE) {
        if (state->kind == STREAM_FUTURE_WRITE &&
            state->span_source_opened) {
            if (!stream_future_next_source_span(state)) {
                (void)esp32_mquickjs_future_wake(runtime, token);
                return true;
            }
            atomic_store_explicit(&state->span_worker_completed, false,
                                  memory_order_release);
            state->span_worker_active = true;
            if (!esp32_mquickjs_future_submit_worker(
                    runtime, token, stream_future_worker, state)) {
                state->span_worker_active = false;
                JS_ThrowInternalError(
                    ctx, "stream Future worker queue is busy");
                return false;
            }
            return true;
        }
        if (!esp32_mquickjs_future_submit_worker(
                runtime, token, stream_future_worker, state)) {
            JS_ThrowInternalError(ctx, "stream Future worker queue is busy");
            return false;
        }
        return true;
    }

    if (state->kind == STREAM_FUTURE_READ) {
        if (stream_slot_read(slot, state->data, state->data_length,
                             &state->io_length) != 0) {
            state->error_number = EIO;
        }
    } else if (state->kind == STREAM_FUTURE_FLUSH) {
        /* Writable memory streams do not currently exist. */
    } else if (state->kind == STREAM_FUTURE_CLOSE) {
        stream_cleanup_slot(slot);
        state->closed = true;
    } else if (state->kind == STREAM_FUTURE_SEEK &&
               stream_slot_seek(slot, state->offset, state->whence,
                                &state->position) != 0) {
        state->error_number = EIO;
    } else if (state->kind == STREAM_FUTURE_WRITE) {
        state->error_number = EBADF;
    }
    atomic_store_explicit(&state->completed, true, memory_order_release);
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

static esp32_mquickjs_future_poll_t stream_future_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL && state->span_source_opened) {
        if (atomic_load_explicit(&state->completed, memory_order_acquire)) {
            return ESP32_MQUICKJS_FUTURE_READY;
        }
        if (!state->span_worker_active ||
            !atomic_load_explicit(&state->span_worker_completed,
                                  memory_order_acquire)) {
            return ESP32_MQUICKJS_FUTURE_PENDING;
        }
        state->span_worker_active = false;
        if (state->error_number != 0 ||
            atomic_load_explicit(&state->cancelled, memory_order_acquire) ||
            !stream_future_next_source_span(state)) {
            atomic_store_explicit(&state->completed, true,
                                  memory_order_release);
            return ESP32_MQUICKJS_FUTURE_READY;
        }
        atomic_store_explicit(&state->span_worker_completed, false,
                              memory_order_release);
        state->span_worker_active = true;
        if (!esp32_mquickjs_future_submit_worker(
                state->runtime, state->token, stream_future_worker, state)) {
            state->span_worker_active = false;
            state->error_number = EBUSY;
            atomic_store_explicit(&state->completed, true,
                                  memory_order_release);
            return ESP32_MQUICKJS_FUTURE_READY;
        }
        return ESP32_MQUICKJS_FUTURE_PENDING;
    }
    return state != NULL && atomic_load_explicit(
                                &state->completed, memory_order_acquire)
        ? ESP32_MQUICKJS_FUTURE_READY
        : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue stream_future_finish(
    JSContext *ctx,
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || atomic_load_explicit(
                             &state->cancelled, memory_order_acquire)) {
        return JS_ThrowInternalError(ctx, "stream operation cancelled");
    }
    if (state->source_error_retained) {
        return JS_Throw(ctx, state->source_error_ref.val);
    }
    if (state->error_number != 0) {
        return JS_ThrowInternalError(ctx, "stream operation failed (%s)",
                                     strerror(state->error_number));
    }
    if (state->kind == STREAM_FUTURE_READ) {
        if (state->io_length == 0) {
            return JS_NULL;
        }
        if (state->binary) {
            JSValue result = esp32_mquickjs_new_owned_byte_view(
                ctx, state->data, state->io_length);

            if (!JS_IsException(result)) {
                state->data = NULL;
            }
            return result;
        }
        state->data[state->io_length] = '\0';
        return JS_NewStringLen(ctx, (const char *)state->data,
                               state->io_length);
    }
    if (state->kind == STREAM_FUTURE_WRITE) {
        return JS_NewInt64(ctx, (int64_t)state->io_length);
    }
    if (state->kind == STREAM_FUTURE_SEEK) {
        return JS_NewInt64(ctx, state->position);
    }
    return JS_TRUE;
}

static esp32_mquickjs_cancel_result_t stream_future_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || atomic_load_explicit(
                             &state->completed, memory_order_acquire) ||
        atomic_exchange_explicit(&state->cancelled, true,
                                 memory_order_acq_rel)) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    return ESP32_MQUICKJS_CANCEL_REQUESTED;
}

static void stream_future_destroy(
    esp32_mquickjs_future_driver_state_t *state)
{
    stream_future_release(state);
}

static esp32_mquickjs_resource_key_t stream_future_resource_key(
    const esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL ? state->resource_key : NULL;
}

#define STREAM_FUTURE_DRIVER(name, prepare_fn) \
    static const esp32_mquickjs_future_driver_t name = { \
        .capture = prepare_fn, \
        .start = stream_future_start, \
        .poll = stream_future_poll, \
        .finish = stream_future_finish, \
        .cancel = stream_future_cancel, \
        .destroy = stream_future_destroy, \
        .resource_key = stream_future_resource_key, \
    }

STREAM_FUTURE_DRIVER(s_stream_read_driver, stream_read_future_prepare);
STREAM_FUTURE_DRIVER(s_stream_write_driver, stream_write_future_prepare);
STREAM_FUTURE_DRIVER(s_stream_flush_driver, stream_flush_future_prepare);
STREAM_FUTURE_DRIVER(s_stream_close_driver, stream_close_future_prepare);
STREAM_FUTURE_DRIVER(s_stream_seek_driver, stream_seek_future_prepare);

#undef STREAM_FUTURE_DRIVER

bool esp32_mquickjs_init_stream_runtime(JSContext *ctx,
                                        esp32_mquickjs_runtime_t *runtime)
{
    static const char *names[] = { "read", "write", "flush", "close", "seek" };
    static const esp32_mquickjs_future_driver_t *drivers[] = {
        &s_stream_read_driver, &s_stream_write_driver, &s_stream_flush_driver,
        &s_stream_close_driver, &s_stream_seek_driver,
    };
    JSGCRef global_ref;
    JSGCRef constructor_ref;
    JSGCRef prototype_ref;
    JSValue *global_obj = JS_PushGCRef(ctx, &global_ref);
    JSValue *constructor = JS_PushGCRef(ctx, &constructor_ref);
    JSValue *prototype = JS_PushGCRef(ctx, &prototype_ref);
    size_t index;
    bool success = true;

    *global_obj = JS_GetGlobalObject(ctx);
    *constructor = JS_IsException(*global_obj)
        ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *global_obj, "Stream");
    *prototype = JS_IsException(*constructor)
        ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *constructor, "prototype");
    for (index = 0; success && index < sizeof(names) / sizeof(names[0]); ++index) {
        JSGCRef method_ref;
        JSValue *method = JS_PushGCRef(ctx, &method_ref);

