99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_stream.c
        *method = JS_IsException(*prototype)
            ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *prototype, names[index]);
        success = !JS_IsException(*method) &&
                  esp32_mquickjs_future_register_driver(
                      ctx, runtime, *method, drivers[index]);
        JS_PopGCRef(ctx, &method_ref);
    }
    JS_PopGCRef(ctx, &prototype_ref);
    JS_PopGCRef(ctx, &constructor_ref);
    JS_PopGCRef(ctx, &global_ref);
    if (!success && !JS_HasException(ctx)) {
        JS_ThrowInternalError(ctx, "failed to register Stream Future drivers");
    }
    return success;
}

JSValue js_stream_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "Stream cannot be constructed directly");
}

void js_stream_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_stream_object_ref_t *object_ref = opaque;
    esp32_mquickjs_fs_stream_ref_t ref;
    esp32_mquickjs_stream_slot_t *slot;

    (void)ctx;
    if (object_ref == NULL) {
        return;
    }
    ref.stream_id = object_ref->stream_id;
    ref.generation = object_ref->generation;
    slot = stream_get_slot(&ref);
    if (slot != NULL) {
        if (slot->owner_count > 0) {
            slot->owner_count--;
        }
        if (slot->owner_count == 0) {
            if (stream_slot_busy(slot)) {
                slot->release_pending = true;
            } else {
                stream_cleanup_slot(slot);
            }
        }
    }
    heap_caps_free(object_ref);
}

static JSValue stream_future_call_and_wait(JSContext *ctx,
                                           JSValue receiver,
                                           const char *method_name,
                                           int argc,
                                           JSValue *argv)
{
    JSGCRef receiver_ref;
    JSGCRef method_ref;
    JSValue *rooted_receiver = JS_PushGCRef(ctx, &receiver_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *rooted_receiver = receiver;
    *method = JS_GetPropertyStr(ctx, *rooted_receiver, method_name);
    result = JS_IsException(*method)
        ? JS_EXCEPTION
        : esp32_mquickjs_future_call_and_wait(
              ctx, esp32_mquickjs_get_active_runtime(), *method,
              *rooted_receiver, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &receiver_ref);
    return result;
}

#define STREAM_DIRECT_WRAPPER(function_name, method_name) \
    JSValue function_name(JSContext *ctx, JSValue *this_val, \
                          int argc, JSValue *argv) \
    { \
        return stream_future_call_and_wait(ctx, *this_val, method_name, \
                                           argc, argv); \
    }

STREAM_DIRECT_WRAPPER(js_stream_close, "close")
STREAM_DIRECT_WRAPPER(js_stream_flush, "flush")

JSValue js_stream_tell(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_fs_stream_ref_t stream_ref;
    esp32_mquickjs_stream_slot_t *slot = NULL;
    int64_t pos;

    (void)argc;
    (void)argv;
    if (stream_get_this_slot(ctx, *this_val, "stream.tell", &stream_ref, &slot) != 0) {
        return JS_EXCEPTION;
    }
    if (stream_slot_busy(slot)) {
        return JS_ThrowInternalError(ctx, "stream.tell() refused because the stream is busy");
    }
    pos = stream_slot_tell(slot);
    if (pos < 0) {
        return JS_ThrowInternalError(ctx, "stream.tell() failed");
    }
    return JS_NewInt64(ctx, pos);
}

STREAM_DIRECT_WRAPPER(js_stream_seek, "seek")

JSValue js_stream_eof(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_fs_stream_ref_t stream_ref;
    esp32_mquickjs_stream_slot_t *slot = NULL;

    (void)argc;
    (void)argv;
    if (stream_get_this_slot(ctx, *this_val, "stream.eof", &stream_ref, &slot) != 0) {
        return JS_EXCEPTION;
    }
    if (stream_slot_busy(slot)) {
        return JS_ThrowInternalError(ctx, "stream.eof() refused because the stream is busy");
    }
    return JS_NewBool(stream_slot_eof(slot));
}

STREAM_DIRECT_WRAPPER(js_stream_read, "read")
STREAM_DIRECT_WRAPPER(js_stream_write, "write")

#undef STREAM_DIRECT_WRAPPER
